# คำสั่งแสดงผลข้อมูลใดๆ หลายประเภทใน print() เดียว เขียนได้ 4 วิธี
# วิธีที่ 1 ใช้ , (ตรงที่ , เวลาแสดงผลจะเว้น 1 space)
print('DTI',999,'Bangna',10+20,20>30,True,False,'Hi',158.45) # จะแสดงผลเป็น 1 บรรทัด

# วิธีที่ 2 ใช้ + (ข้อมูลไหนที่ไม่ใช่ string ต้องทำให้เป็น string ก่อนด้วยฟังก์ชั่น str())
print('DTI' + str(999) + 'Bangna' + str(10+20) + str(20>30) + str(True) + str(False) + 'Hi' + str(158.45))
print('DTI ' + str(999) + ' Bangna ' + str(10+20) + ' ' + str(20>30) + ' ' + str(True) + ' ' + str(False) + ' Hi ' + str(158.45))

# วิธีที่ 3 ใช้เมธอด format() - ข้อมูลที่จะแสดงต้องเป็น string
# (ข้อมูลไหนที่ไม่ใช่ string ให้เขียนในวงเล็บของ format และตรงจุดที่จะแสดงข้อมูลนั้นให้ใส่ {} แทน)
print('DTI {} Bangna {} {} {} {} Hi {}'.format(999,10+20,20>30,True,False,158.45))

# index number          0    1    2    3
print('{3} {0} {1} {2} {1}'.format('aa','bb','cc','dd'))

# วิธีที่ 4 ใช้ f-string ข้อมูลที่จะแสดงผลต้องเป็น string โดยจะต้องมี f นำหน้า
# (ข้อมูลที่ไม่ใช่ string ให้เขียนใน {} ณ ตำแหน่งที่จะแสดงนั้นได้เลย)
print(f'DTI {999} Bangna {10+20} {20>30} {True} {False} Hi {158.45}')